app/controllers/comments_controller.rb

    def create
      @post = Post.find(params[:post_id])
      @comment = @post.comments.create(comment_params)
---
SELECT  "posts".* FROM "posts" WHERE "posts"."id" = $1 LIMIT $2  [["id", nil], ["LIMIT", 1]]
INSERT INTO "comments" ("message", "created_at", "updated_at", "post_id") VALUES ($1, $2, $3, $4) RETURNING "id"  [["message", "wefewf"], ["created_at", 2017-10-11 23:44:31 UTC], ["updated_at", 2017-10-11 23:44:31 UTC], ["post_id", 4]]