app/controllers/posts_controller.rb

SELECT "posts".* FROM "posts" ORDER BY "posts"."created_at" DESC
SELECT "categories".* FROM "categories"
---
  def index
    @posts = Post.search(params[:search])
    @categories = Category.all

INSERT INTO "posts" ("title", "body", "cost", "category_id", "user_id", "latitude", "longitude", "address", "created_at", "updated_at", "image_file_name", "image_content_type", "image_file_size", "image_updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9, $10, $11, $12, $13, $14) RETURNING "id"
---
  def create
    @post = current_user.posts.new(post_params)

   if @post.save

SELECT "categories".* FROM "categories"
---
  def edit
    @categories = Category.all

DELETE FROM "posts" WHERE "posts"."id" = $1  [["id", 1]]
---
  def destroy
    if find_post.destroy