app/controllers/users_controller.rb

def show
    @posts = @user.posts
    @posts = Post.search(params[:search])
---
SELECT "posts".* FROM "posts" WHERE "posts"."user_id" = $1  [["user_id", 1]]