app/views/categories/show.html.erb


  <%@category.posts.each do |post|%>
---
SELECT "posts".* FROM "posts" WHERE "posts"."category_id" = $1  [["category_id", 9]]